Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/adc/hal_adc_driver.cpp
			if(batchModeADC)
			{
				// Disable the trigger if the batch mode is true
				TIM_Cmd(TIM3, DISABLE);
			}
		}
	}

	void DMA_HAL_HANDLER1(void *param)
	{
		// Record the time as close to the completion of sampling as possible
		g_timeStamp = HAL_Time_CurrentTicks();

		if(DMA_GetFlagStatus(DMA1_FLAG_TC1) != RESET)
		{
			DMA_ClearITPendingBit(DMA1_IT_TC1);

			if(!dualADCMode)
			{
				memcpy(g_adcUserBufferChannel1Ptr, g_adcDriverBufferChannel1Ptr, adcNumSamples * sizeof(UINT16));
			}
			else
			{
				// Possible memory corruption if adcNumSamples != length of g_adcDriverBufferDualModePtr
				// Possible only while conducting native tests as C# programs use dynamic memory
				// allocated from the heap
				// BTW this is because the hardware in dual mode stores in the most significant bits of
				// ADC1_DR the result of ADC2 and the least significant bits of ADC1_DR the result
				// of ADC1. Pretty cool  !!!
				for(UINT16 i = 0; i < adcNumSamples; i++)
				{
					g_adcUserBufferChannel1Ptr[i] = (g_adcDriverBufferDualModePtr[i] & 0xffff);
					g_adcUserBufferChannel2Ptr[i] = (g_adcDriverBufferDualModePtr[i] >> 16);
				}
			}

			// Call the user with the current value of ticks
			g_callback(&g_timeStamp);

			if(batchModeADC)
			{
				// Disable the trigger if the batch mode is true
				TIM_Cmd(TIM3, DISABLE);
			}

		}
	}

	void TIM_HAL_HANDLER(void *param)
	{
		//if(TIM_GetFlagStatus(TIM4, TIM_IT_CC4))
		if(TIM_GetITStatus(TIM4, TIM_IT_CC4))
		{
			TIM_ClearITPendingBit(TIM4, TIM_IT_CC4);
		}
	}
}

